import FAQItem from "../components/questions/Questions"
import styles from "./SixthScreen.module.css"

const Sixthscreen = () => {
    return (
        <>
            <div className={styles.title}>אני בטוחה שעכשיו יהיו פחות..</div>
  <div className={styles.subtitle}>לחצי על כל שאלה והתשובה תיפתח</div>
            {/* הסרת קעקוע */}
            <div className={styles.subtitle}>הסרת קעקועים</div>
            <FAQItem 
                question="האם הסרת קעקוע זה טיפול כואב?" 
                answer="התחושה דומה לעקצוץ או צריבה מהירה. אנחנו משתמשות באלחוש לפני התחלת הטיפול כדי להקל כמה שיותר במידת הצורך"
            />
            <FAQItem 
                question="כמה טיפולים דרושים להסרה?" 
                answer="בין 2-5 טיפולים להסרה איכותית. במקרים חריגים בהם בוצעו מספר רב של טיפולי איפור קבוע יידרשו יותר טיפולים"
            />
            <FAQItem 
                question="האם ניתן להסיר כל צבע?" 
                answer="ניתן להסיר צבעים כהים (כמו שחור) כחול אפור. וצבעים חמים כמו אדום, כתום. צבעים כמו ירוק, וסגול קשים יותר לפירוק"
            />
            <FAQItem 
                question="האם ההסרה משאירה צלקות?" 
                answer="כשזה נעשה במכשור מקצועי, ע״י יד מיומנת ובפרוטוקול נכון – לא אמורות להישאר צלקות. חשוב מאוד להקפיד על הוראות ההחלמה בין הטיפולים"
            />

            {/* הסרת נגעים */}
            <div className={styles.subtitle}>הסרת נגעים</div>
            <FAQItem 
                question="האם הנגעים יחזרו אחרי ההסרה?" 
                answer="ברוב המקרים ההסרה היא לצמיתות. אך הגוף יכול ליצור חדשים עם הזמן, במיוחד אם יש נטייה גנטית או חשיפה לשמש"
            />
            <FAQItem 
                question="האם הסרת נגעים משאירה צלקות?" 
                answer="לא בהכרח. השיטה שפיתחתי מבטיחה תוצאות עם מינימום פגיעה בעור – התוצאה לרוב אסתטית מאוד ולא מורגש שהיו נגעים קודמים באיזור. יתכן סימן זמני בשלב בו האיזור עוד לא החלים המטשטש עם הזמן. שמירה על הוראות הטיפול אחרי ההסרה זה המפתח"
            />
            <FAQItem 
                question="האם אפשר להסיר נגעים בהריון?" 
                answer="נעדיף לחכות לאחר ההריון, אלא אם מדובר בנגע מפריע במיוחד. בזמן ההריון יש שינויים הורמונליים שיכולים להשפיע על ריפוי וצלקת"
            />
            <FAQItem 
                question="הסרת נגעים זה כואב?" 
                answer="לפני הטיפול מבוצע אלחוש המבטיח טיפול נינוח וללא כאבים ומדובר בטיפול מהיר במיוחד"
            />

            {/* טיפולי פנים */}
            <div className={styles.subtitle}>טיפולי פנים</div>
            <FAQItem 
                question="האם ניתן לבצע טיפולי פנים בהריון?" 
                answer="בהחלט ואפילו מומלץ! לאחר שבוע 11 ניתן להגיע לטיפולים כרגיל ואף מומלץ לתת לעור שגרת טיפוח עקבית על מנת למנוע התפרצויות/פיגמנטציה/שינויים שחלים על העור עקב השינוי ההורמונלי."
            />
            <FAQItem 
                question="האם אני חייבת לרכוש מוצרים כדי לראות תוצאות?" 
                answer="כן, על מנת שנצליח להגיע לתוצאה איכותית הנראית לעין. הטיפול בקליניקה הוא 50% מההצלחה. המוצרים ממשיכים את העבודה בבית – ובלי שגרה נכונה העור חוזר למצבו הקודם מהר מאוד. המטרה היא לרפד אותך בשגרה שתגרום לעור שלך להגיע למקסימום תוצאות."
            />
            <FAQItem 
                question="האם טיפול אחד מספיק כדי לראות שינוי משמעותי בעור שלי?" 
                answer="טיפול אחד יכול לרענן ולהאיר את העור – אבל שיפור עמוק ואמיתי (מרקם, פיגמנטציה, אקנה וכו') מגיע עם תהליך קבוע ושילוב של שגרה ביתית מותאמת. כמו חדר כושר לעור – התמדה = תוצאה"
            />
            <FAQItem 
                question="זה נכון שאם אני מתחילה עם טיפולי פנים יהיו לי יותר שחורים ויופיעו לי צלקות?" 
                answer="זה מיתוס לחלוטין! טיפול נכון ומקצועי לא פוגע בעור אלא להפך – מנקה, מחטא ומעודד התחדשות. הפתיחה של הנקבוביות זמנית ומבוקרת (בעזרת אדים/חומצות), ואחריה מגיע כיווץ חידוש והזנה. בסיום הטיפול נדרשים ימי החלמה בודדים ואת נשלחת עם הוראות מדוייקות לבית"
            />
        </>
    )
}

export default Sixthscreen
